# Pr√°ctica Individual - Joins con Pandas

In [1]:
import pandas as pd
from IPython.display import display

In [2]:
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
df3 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisor': ['Carly', 'Guido', 'Steve']})

In [3]:
display(df1)
display(df2)
display(df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

         group supervisor
0   Accounting      Carly
1  Engineering      Guido
2           HR      Steve

In [4]:
# Utilizando merge y joins obtener un dataframe como resultado de los tres anteriores 

df_full = pd.merge(pd.merge(df1, df2, on="employee"), df3, on="group")
df_full

  employee        group  hire_date supervisor
0      Bob   Accounting       2008      Carly
1     Jake  Engineering       2012      Guido
2     Lisa  Engineering       2004      Guido
3      Sue           HR       2014      Steve

In [5]:
# Generar un nuevo dataframe que contenga el resultado de los tres anteriores y df4
df4 = pd.DataFrame({'applier': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'position': ['CTO', 'Senior Developer', 'CFO', 'Head of HR']})

In [6]:
display(df4)

  applier          position
0     Bob               CTO
1    Jake  Senior Developer
2    Lisa               CFO
3     Sue        Head of HR

In [7]:
df_full = pd.merge(df_full,df4,left_on="employee",right_on="applier")
df_full

  employee        group  hire_date supervisor applier          position
0      Bob   Accounting       2008      Carly     Bob               CTO
1     Jake  Engineering       2012      Guido    Jake  Senior Developer
2     Lisa  Engineering       2004      Guido    Lisa               CFO
3      Sue           HR       2014      Steve     Sue        Head of HR

In [8]:
# Utilizar el m√©todo drop() para eliminar las columnas redudantes
df_full = df_full.drop("employee", axis=1)
df_full

         group  hire_date supervisor applier          position
0   Accounting       2008      Carly     Bob               CTO
1  Engineering       2012      Guido    Jake  Senior Developer
2  Engineering       2004      Guido    Lisa               CFO
3           HR       2014      Steve     Sue        Head of HR

In [9]:
df1 = pd.DataFrame({"a":[1],"b":[2],"c":[3]})
df2 = pd.DataFrame({"a":[1,4],"b":[7,9],"c":[8,9]})
# Utilizando los DataFrames anteriores realizar un inner, outer, left y right merges entre ellos usando la columna 'a'.
# Antes de ejecutar cada join escribir un comentario con el output esperado.

In [10]:
# INNER JOIN: Si unimos por la columna "a" se espera que aparezcan las columnas b y c con nuevos nombres
# para el primer rengl√≥n del segundo dataframe.

pd.merge(df1,df2,on="a",how="inner", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1      2      3      7      8

In [11]:
# LEFT JOIN: En este caso, se espera el mismo resultado que con inner

pd.merge(df1,df2,on="a",how="left", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1      2      3      7      8

In [12]:
# OUTTER JOIN: Se espera que traiga los dos casos con las columnas b y c en null para el segundo caso.

pd.merge(df1,df2,on="a",how="outer", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1    2.0    3.0      7      8
1  4    NaN    NaN      9      9

In [13]:
# RIGHT JOIN: En este caso, se espera el mismo resultado que con outter 

pd.merge(df1,df2,on="a",how="outer", suffixes=('_df1', '_df2'))

   a  b_df1  c_df1  b_df2  c_df2
0  1    2.0    3.0      7      8
1  4    NaN    NaN      9      9